// ConsoleApplication2.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    printf("문장"); //문장이라는 문자를 출력
    printf("Hello World");
    printf("Hello\nWorld"); //줄 구분해서 출력
    printf("\"hello\""); //\"사용시 "같이 출력
    printf("\\hello world\\"); // \\사용시 \를 같이 출력
//d // 10진수로 표현해보자
    int n = 10; //정수를 입력
    printf("%d",n);
    //실수형
    double d = 12.345;
    printf("%f", d); //f d 같은거 겹치지 않게 조심하기
    //지수형
    double z = 12.3456789;
    printf("%e", z);
    //8진수로 출력
    int a = 1023;
    printf("%o", a);
    //16진수로 출력
    int a1 = 1023;
    printf("%x", a1);
    //부호없는 10진수로 출력
    int a2 = 1023;
    printf("%u", a2);
    //실수형으로 자동 출력
    double d1 = 12.3456789;
    printf("%g", d1);
    //하나의 문자로 출력
    char c = 'a';
    printf("%c", c);
    //문자열을 출력
    char x[5] = "abcd";
    printf("%s",x);

    return 0; //끝내는 명령어
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
